backend/app/controllers/results_controller.rb

    def create


        user = User.find_by(username: params[:username])

        if (user && params[:test_id])

            user.results.build(test_id: params[:test_id], test_subject: params[:test_subject], test_difficulty: params[:test_difficulty], test_score: params[:test_score])
            user.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "acapp"], ["LIMIT", 1]]
INSERT INTO "results" ("user_id", "test_id", "test_subject", "test_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["test_id", 66], ["test_subject", "Entertainment: Books"], ["test_score", 0.0], ["created_at", "2020-07-19 21:21:18.713287"], ["updated_at", "2020-07-19 21:21:18.713287"]]