backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "acapp"], ["LIMIT", 1]]
---
    def create()
        # byebug
        user = User.find_by(username: params[:username])