backend/app/controllers/users_controller.rb

    def index()
        render json: User.all
---
SELECT "users".* FROM "users"